Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::Elbow Class Referencefinal
MEP Element Manager
The Elbow can connect two straight RoutingSegments with the same dimensions but different directions. More...
#include <MEPElbow.hpp>
 Inheritance diagram for ACAPI::MEP::Elbow:
 Public Member Functions
std::optional< double >  | GetInsulationThickness () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
double  | GetRadius () const
Result< double >  | GetFactorRadius () const
The radius of the Elbow is calculated with the help of this value in the case of rectangular Duct and Cable Carrier.
UniqueID  | GetRoutingNodeId () const
Domain  | GetDomain () const
ElbowDefault  | PickUpDefault () const
Result< UniqueID >  | GetPreferenceTable () const
 Public Member Functions inherited from ACAPI::MEP::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< Elbow >  | Get (const UniqueID &uniqueId)
Returns an Elbow.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The Elbow can connect two straight RoutingSegments with the same dimensions but different directions.
This type of element can be placed in RoutingNodes.
Since
Archicad 27
Example code snippet from Test/New MEP
Getters
 ACAPI::Result<Elbow> elbow = Elbow::Get (id);
 if (elbow.IsErr ()) {
 ACAPI_WriteReport (elbow.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter elbowReporter (3);
 elbowReporter.Add ("Elbow id", id);
 elbowReporter.SetTabCount (4);
 ACAPI::Result<double> factorRadius = elbow->GetFactorRadius ();
 if (factorRadius.IsOk ())
 elbowReporter.Add ("Factor Radius", *factorRadius);
 elbowReporter.Add ("Radius", elbow->GetRadius ());
 elbowReporter.Add ("Width", elbow->GetWidth ());
 elbowReporter.Add ("Height", elbow->GetHeight ());
 elbowReporter.Add ("Shape", elbow->GetShape ());
 std::optional<double> insulation = elbow->GetInsulationThickness ();
 insulation.has_value () ? elbowReporter.Add ("Insulation thickness", *insulation) : elbowReporter.Add ("Does not have insulation.");
 elbowReporter.Write ();
 Labeling
 for (const UniqueID& elbowId : routingSegment->GetElbowIds ()) {
 const API_Guid elbowGuid = GSGuid2APIGuid (elbowId.GetGuid ());
 const API_Guid labeledElemGuid = isSectElem ? elemIdToSectElemId.Get (elbowGuid, APINULLGuid) : elbowGuid;
 const API_Guid labelGuid = PlaceLabelOn (labeledElemGuid);
 if (labelGuid == APINULLGuid)
 return Error;
 GS::Array<API_Guid> connectedLabels;
 ERRCHK_NO_ASSERT (ACAPI_Grouping_GetConnectedElements (labeledElemGuid, API_LabelID, &connectedLabels));
 if (!connectedLabels.Contains (labelGuid))
 return Error;
 }
Member Function Documentation
◆ Get()
 static Result< Elbow > ACAPI::MEP::Elbow::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns an Elbow.
Parameters
uniqueId | The UniqueID of the requested Elbow.
Returns
If the uniqueId belongs to an Elbow, returns the object associated to it, otherwise Error.
◆ GetDomain()
 Domain ACAPI::MEP::Elbow::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the Elbow.
◆ GetFactorRadius()
 Result< double > ACAPI::MEP::Elbow::GetFactorRadius  |  ( |   | ) |   const
The radius of the Elbow is calculated with the help of this value in the case of rectangular Duct and Cable Carrier.
Returns
Returns the factor radius of the Elbow in the case of rectangular Duct and Cable Carrier, otherwise Error.
◆ GetHeight()
 double ACAPI::MEP::Elbow::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the Elbow.
◆ GetInsulationThickness()
 std::optional< double > ACAPI::MEP::Elbow::GetInsulationThickness  |  ( |   | ) |   const
Returns
Returns the insulation thickness if the Elbow has insulation, otherwise std::nullopt. Elbow of cable carrier domain cannot have insulation.
◆ GetPreferenceTable()
 Result< UniqueID > ACAPI::MEP::Elbow::GetPreferenceTable  |  ( |   | ) |   const
Returns
Returns the UniqueID of the PreferenceTable if a circular DuctElbow or a PipeElbow, in the case of rectangular DuctElbow and CableCarrierElbow returns Error.
◆ GetRadius()
 double ACAPI::MEP::Elbow::GetRadius  |  ( |   | ) |   const
Returns
Returns the radius of the Elbow.
◆ GetRoutingNodeId()
 UniqueID ACAPI::MEP::Elbow::GetRoutingNodeId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingNode that it belongs to.
◆ GetShape()
 ConnectorShape ACAPI::MEP::Elbow::GetShape  |  ( |   | ) |   const
Returns
Returns the shape of the Elbow.
◆ GetWidth()
 double ACAPI::MEP::Elbow::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the Elbow.
◆ PickUpDefault()
 ElbowDefault ACAPI::MEP::Elbow::PickUpDefault  |  ( |   | ) |   const
Returns
Returns an ElbowDefault with the parameters of the object it was called for.